zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TXBRP_OFFSET                   (0xCC)                                        /**<  (MCAN_TXBRP) Transmit Buffer Request Pending Register  Offset */

#define MCAN_TXBRP_TRP0_Pos                 0                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 0 Position */
#define MCAN_TXBRP_TRP0_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP0_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 0 Mask */
#define MCAN_TXBRP_TRP0                     MCAN_TXBRP_TRP0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP0_Msk instead */
#define MCAN_TXBRP_TRP1_Pos                 1                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 1 Position */
#define MCAN_TXBRP_TRP1_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP1_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 1 Mask */
#define MCAN_TXBRP_TRP1                     MCAN_TXBRP_TRP1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP1_Msk instead */
#define MCAN_TXBRP_TRP2_Pos                 2                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 2 Position */
#define MCAN_TXBRP_TRP2_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP2_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 2 Mask */
#define MCAN_TXBRP_TRP2                     MCAN_TXBRP_TRP2_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP2_Msk instead */
#define MCAN_TXBRP_TRP3_Pos                 3                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 3 Position */
#define MCAN_TXBRP_TRP3_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP3_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 3 Mask */
#define MCAN_TXBRP_TRP3                     MCAN_TXBRP_TRP3_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP3_Msk instead */
#define MCAN_TXBRP_TRP4_Pos                 4                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 4 Position */
#define MCAN_TXBRP_TRP4_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP4_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 4 Mask */
#define MCAN_TXBRP_TRP4                     MCAN_TXBRP_TRP4_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP4_Msk instead */
#define MCAN_TXBRP_TRP5_Pos                 5                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 5 Position */
#define MCAN_TXBRP_TRP5_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP5_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 5 Mask */
#define MCAN_TXBRP_TRP5                     MCAN_TXBRP_TRP5_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP5_Msk instead */
#define MCAN_TXBRP_TRP6_Pos                 6                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 6 Position */
#define MCAN_TXBRP_TRP6_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP6_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 6 Mask */
#define MCAN_TXBRP_TRP6                     MCAN_TXBRP_TRP6_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP6_Msk instead */
#define MCAN_TXBRP_TRP7_Pos                 7                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 7 Position */
#define MCAN_TXBRP_TRP7_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP7_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 7 Mask */
#define MCAN_TXBRP_TRP7                     MCAN_TXBRP_TRP7_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP7_Msk instead */
#define MCAN_TXBRP_TRP8_Pos                 8                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 8 Position */
#define MCAN_TXBRP_TRP8_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP8_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 8 Mask */
#define MCAN_TXBRP_TRP8                     MCAN_TXBRP_TRP8_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP8_Msk instead */
#define MCAN_TXBRP_TRP9_Pos                 9                                              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 9 Position */
#define MCAN_TXBRP_TRP9_Msk                 (_U_(0x1) << MCAN_TXBRP_TRP9_Pos)              /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 9 Mask */
#define MCAN_TXBRP_TRP9                     MCAN_TXBRP_TRP9_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP9_Msk instead */
#define MCAN_TXBRP_TRP10_Pos                10                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 10 Position */
#define MCAN_TXBRP_TRP10_Msk                (_U_(0x1) << MCAN_TXBRP_TRP10_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 10 Mask */
#define MCAN_TXBRP_TRP10                    MCAN_TXBRP_TRP10_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP10_Msk instead */
#define MCAN_TXBRP_TRP11_Pos                11                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 11 Position */
#define MCAN_TXBRP_TRP11_Msk                (_U_(0x1) << MCAN_TXBRP_TRP11_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 11 Mask */
#define MCAN_TXBRP_TRP11                    MCAN_TXBRP_TRP11_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP11_Msk instead */
#define MCAN_TXBRP_TRP12_Pos                12                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 12 Position */
#define MCAN_TXBRP_TRP12_Msk                (_U_(0x1) << MCAN_TXBRP_TRP12_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 12 Mask */
#define MCAN_TXBRP_TRP12                    MCAN_TXBRP_TRP12_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP12_Msk instead */
#define MCAN_TXBRP_TRP13_Pos                13                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 13 Position */
#define MCAN_TXBRP_TRP13_Msk                (_U_(0x1) << MCAN_TXBRP_TRP13_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 13 Mask */
#define MCAN_TXBRP_TRP13                    MCAN_TXBRP_TRP13_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP13_Msk instead */
#define MCAN_TXBRP_TRP14_Pos                14                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 14 Position */
#define MCAN_TXBRP_TRP14_Msk                (_U_(0x1) << MCAN_TXBRP_TRP14_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 14 Mask */
#define MCAN_TXBRP_TRP14                    MCAN_TXBRP_TRP14_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP14_Msk instead */
#define MCAN_TXBRP_TRP15_Pos                15                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 15 Position */
#define MCAN_TXBRP_TRP15_Msk                (_U_(0x1) << MCAN_TXBRP_TRP15_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 15 Mask */
#define MCAN_TXBRP_TRP15                    MCAN_TXBRP_TRP15_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP15_Msk instead */
#define MCAN_TXBRP_TRP16_Pos                16                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 16 Position */
#define MCAN_TXBRP_TRP16_Msk                (_U_(0x1) << MCAN_TXBRP_TRP16_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 16 Mask */
#define MCAN_TXBRP_TRP16                    MCAN_TXBRP_TRP16_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP16_Msk instead */
#define MCAN_TXBRP_TRP17_Pos                17                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 17 Position */
#define MCAN_TXBRP_TRP17_Msk                (_U_(0x1) << MCAN_TXBRP_TRP17_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 17 Mask */
#define MCAN_TXBRP_TRP17                    MCAN_TXBRP_TRP17_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP17_Msk instead */
#define MCAN_TXBRP_TRP18_Pos                18                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 18 Position */
#define MCAN_TXBRP_TRP18_Msk                (_U_(0x1) << MCAN_TXBRP_TRP18_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 18 Mask */
#define MCAN_TXBRP_TRP18                    MCAN_TXBRP_TRP18_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP18_Msk instead */
#define MCAN_TXBRP_TRP19_Pos                19                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 19 Position */
#define MCAN_TXBRP_TRP19_Msk                (_U_(0x1) << MCAN_TXBRP_TRP19_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 19 Mask */
#define MCAN_TXBRP_TRP19                    MCAN_TXBRP_TRP19_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP19_Msk instead */
#define MCAN_TXBRP_TRP20_Pos                20                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 20 Position */
#define MCAN_TXBRP_TRP20_Msk                (_U_(0x1) << MCAN_TXBRP_TRP20_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 20 Mask */
#define MCAN_TXBRP_TRP20                    MCAN_TXBRP_TRP20_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP20_Msk instead */
#define MCAN_TXBRP_TRP21_Pos                21                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 21 Position */
#define MCAN_TXBRP_TRP21_Msk                (_U_(0x1) << MCAN_TXBRP_TRP21_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 21 Mask */
#define MCAN_TXBRP_TRP21                    MCAN_TXBRP_TRP21_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP21_Msk instead */
#define MCAN_TXBRP_TRP22_Pos                22                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 22 Position */
#define MCAN_TXBRP_TRP22_Msk                (_U_(0x1) << MCAN_TXBRP_TRP22_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 22 Mask */
#define MCAN_TXBRP_TRP22                    MCAN_TXBRP_TRP22_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP22_Msk instead */
#define MCAN_TXBRP_TRP23_Pos                23                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 23 Position */
#define MCAN_TXBRP_TRP23_Msk                (_U_(0x1) << MCAN_TXBRP_TRP23_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 23 Mask */
#define MCAN_TXBRP_TRP23                    MCAN_TXBRP_TRP23_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP23_Msk instead */
#define MCAN_TXBRP_TRP24_Pos                24                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 24 Position */
#define MCAN_TXBRP_TRP24_Msk                (_U_(0x1) << MCAN_TXBRP_TRP24_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 24 Mask */
#define MCAN_TXBRP_TRP24                    MCAN_TXBRP_TRP24_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP24_Msk instead */
#define MCAN_TXBRP_TRP25_Pos                25                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 25 Position */
#define MCAN_TXBRP_TRP25_Msk                (_U_(0x1) << MCAN_TXBRP_TRP25_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 25 Mask */
#define MCAN_TXBRP_TRP25                    MCAN_TXBRP_TRP25_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP25_Msk instead */
#define MCAN_TXBRP_TRP26_Pos                26                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 26 Position */
#define MCAN_TXBRP_TRP26_Msk                (_U_(0x1) << MCAN_TXBRP_TRP26_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 26 Mask */
#define MCAN_TXBRP_TRP26                    MCAN_TXBRP_TRP26_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP26_Msk instead */
#define MCAN_TXBRP_TRP27_Pos                27                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 27 Position */
#define MCAN_TXBRP_TRP27_Msk                (_U_(0x1) << MCAN_TXBRP_TRP27_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 27 Mask */
#define MCAN_TXBRP_TRP27                    MCAN_TXBRP_TRP27_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP27_Msk instead */
#define MCAN_TXBRP_TRP28_Pos                28                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 28 Position */
#define MCAN_TXBRP_TRP28_Msk                (_U_(0x1) << MCAN_TXBRP_TRP28_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 28 Mask */
#define MCAN_TXBRP_TRP28                    MCAN_TXBRP_TRP28_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP28_Msk instead */
#define MCAN_TXBRP_TRP29_Pos                29                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 29 Position */
#define MCAN_TXBRP_TRP29_Msk                (_U_(0x1) << MCAN_TXBRP_TRP29_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 29 Mask */
#define MCAN_TXBRP_TRP29                    MCAN_TXBRP_TRP29_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP29_Msk instead */
#define MCAN_TXBRP_TRP30_Pos                30                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 30 Position */
#define MCAN_TXBRP_TRP30_Msk                (_U_(0x1) << MCAN_TXBRP_TRP30_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 30 Mask */
#define MCAN_TXBRP_TRP30                    MCAN_TXBRP_TRP30_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP30_Msk instead */
#define MCAN_TXBRP_TRP31_Pos                31                                             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 31 Position */
#define MCAN_TXBRP_TRP31_Msk                (_U_(0x1) << MCAN_TXBRP_TRP31_Pos)             /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 31 Mask */
#define MCAN_TXBRP_TRP31                    MCAN_TXBRP_TRP31_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBRP_TRP31_Msk instead */
#define MCAN_TXBRP_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (MCAN_TXBRP) Register MASK  (Use MCAN_TXBRP_Msk instead)  */
#define MCAN_TXBRP_Msk                      _U_(0xFFFFFFFF)                                /**< (MCAN_TXBRP) Register Mask  */

#define MCAN_TXBRP_TRP_Pos                  0                                              /**< (MCAN_TXBRP Position) Transmission Request Pending for Buffer 3x */
#define MCAN_TXBRP_TRP_Msk                  (_U_(0xFFFFFFFF) << MCAN_TXBRP_TRP_Pos)        /**< (MCAN_TXBRP Mask) TRP */
#define MCAN_TXBRP_TRP(value)               (MCAN_TXBRP_TRP_Msk & ((value) << MCAN_TXBRP_TRP_Pos))  

/* -------- MCAN_TXBAR : (MCAN Offset: 0xd0) (R/W 32) Transmit Buffer Add Request Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t AR0:1;                     /**< bit:      0  Add Request for Transmit Buffer 0        */
    uint32_t AR1:1;                     /**< bit:      1  Add Request for Transmit Buffer 1        */
    uint32_t AR2:1;                     /**< bit:      2  Add Request for Transmit Buffer 2        */
    uint32_t AR3:1;                     /**< bit:      3  Add Request for Transmit Buffer 3        */
    uint32_t AR4:1;                     /**< bit:      4  Add Request for Transmit Buffer 4        */
    uint32_t AR5:1;                     /**< bit:      5  Add Request for Transmit Buffer 5        */
    uint32_t AR6:1;                     /**< bit:      6  Add Request for Transmit Buffer 6        */
    uint32_t AR7:1;                     /**< bit:      7  Add Request for Transmit Buffer 7        */
    uint32_t AR8:1;                     /**< bit:      8  Add Request for Transmit Buffer 8        */
    uint32_t AR9:1;                     /**< bit:      9  Add Request for Transmit Buffer 9        */
    uint32_t AR10:1;                    /**< bit:     10  Add Request for Transmit Buffer 10       */
    uint32_t AR11:1;                    /**< bit:     11  Add Request for Transmit Buffer 11       */
    uint32_t AR12:1;                    /**< bit:     12  Add Request for Transmit Buffer 12       */
    uint32_t AR13:1;                    /**< bit:     13  Add Request for Transmit Buffer 13       */
    uint32_t AR14:1;                    /**< bit:     14  Add Request for Transmit Buffer 14       */
    uint32_t AR15:1;                    /**< bit:     15  Add Request for Transmit Buffer 15       */
    uint32_t AR16:1;                    /**< bit:     16  Add Request for Transmit Buffer 16       */
    uint32_t AR17:1;                    /**< bit:     17  Add Request for Transmit Buffer 17       */
    uint32_t AR18:1;                    /**< bit:     18  Add Request for Transmit Buffer 18       */
    uint32_t AR19:1;                    /**< bit:     19  Add Request for Transmit Buffer 19       */
    uint32_t AR20:1;                    /**< bit:     20  Add Request for Transmit Buffer 20       */
    uint32_t AR21:1;                    /**< bit:     21  Add Request for Transmit Buffer 21       */
    uint32_t AR22:1;                    /**< bit:     22  Add Request for Transmit Buffer 22       */
    uint32_t AR23:1;                    /**< bit:     23  Add Request for Transmit Buffer 23       */
    uint32_t AR24:1;                    /**< bit:     24  Add Request for Transmit Buffer 24       */
    uint32_t AR25:1;                    /**< bit:     25  Add Request for Transmit Buffer 25       */
    uint32_t AR26:1;                    /**< bit:     26  Add Request for Transmit Buffer 26       */
    uint32_t AR27:1;                    /**< bit:     27  Add Request for Transmit Buffer 27       */
    uint32_t AR28:1;                    /**< bit:     28  Add Request for Transmit Buffer 28       */
    uint32_t AR29:1;                    /**< bit:     29  Add Request for Transmit Buffer 29       */
    uint32_t AR30:1;                    /**< bit:     30  Add Request for Transmit Buffer 30       */
    uint32_t AR31:1;                    /**< bit:     31  Add Request for Transmit Buffer 31       */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t AR:32;                     /**< bit:  0..31  Add Request for Transmit Buffer 3x       */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TXBAR_Type;
