zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TXBAR_OFFSET                   (0xD0)                                        /**<  (MCAN_TXBAR) Transmit Buffer Add Request Register  Offset */

#define MCAN_TXBAR_AR0_Pos                  0                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 0 Position */
#define MCAN_TXBAR_AR0_Msk                  (_U_(0x1) << MCAN_TXBAR_AR0_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 0 Mask */
#define MCAN_TXBAR_AR0                      MCAN_TXBAR_AR0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR0_Msk instead */
#define MCAN_TXBAR_AR1_Pos                  1                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 1 Position */
#define MCAN_TXBAR_AR1_Msk                  (_U_(0x1) << MCAN_TXBAR_AR1_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 1 Mask */
#define MCAN_TXBAR_AR1                      MCAN_TXBAR_AR1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR1_Msk instead */
#define MCAN_TXBAR_AR2_Pos                  2                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 2 Position */
#define MCAN_TXBAR_AR2_Msk                  (_U_(0x1) << MCAN_TXBAR_AR2_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 2 Mask */
#define MCAN_TXBAR_AR2                      MCAN_TXBAR_AR2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR2_Msk instead */
#define MCAN_TXBAR_AR3_Pos                  3                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 3 Position */
#define MCAN_TXBAR_AR3_Msk                  (_U_(0x1) << MCAN_TXBAR_AR3_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 3 Mask */
#define MCAN_TXBAR_AR3                      MCAN_TXBAR_AR3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR3_Msk instead */
#define MCAN_TXBAR_AR4_Pos                  4                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 4 Position */
#define MCAN_TXBAR_AR4_Msk                  (_U_(0x1) << MCAN_TXBAR_AR4_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 4 Mask */
#define MCAN_TXBAR_AR4                      MCAN_TXBAR_AR4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR4_Msk instead */
#define MCAN_TXBAR_AR5_Pos                  5                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 5 Position */
#define MCAN_TXBAR_AR5_Msk                  (_U_(0x1) << MCAN_TXBAR_AR5_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 5 Mask */
#define MCAN_TXBAR_AR5                      MCAN_TXBAR_AR5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR5_Msk instead */
#define MCAN_TXBAR_AR6_Pos                  6                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 6 Position */
#define MCAN_TXBAR_AR6_Msk                  (_U_(0x1) << MCAN_TXBAR_AR6_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 6 Mask */
#define MCAN_TXBAR_AR6                      MCAN_TXBAR_AR6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR6_Msk instead */
#define MCAN_TXBAR_AR7_Pos                  7                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 7 Position */
#define MCAN_TXBAR_AR7_Msk                  (_U_(0x1) << MCAN_TXBAR_AR7_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 7 Mask */
#define MCAN_TXBAR_AR7                      MCAN_TXBAR_AR7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR7_Msk instead */
#define MCAN_TXBAR_AR8_Pos                  8                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 8 Position */
#define MCAN_TXBAR_AR8_Msk                  (_U_(0x1) << MCAN_TXBAR_AR8_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 8 Mask */
#define MCAN_TXBAR_AR8                      MCAN_TXBAR_AR8_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR8_Msk instead */
#define MCAN_TXBAR_AR9_Pos                  9                                              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 9 Position */
#define MCAN_TXBAR_AR9_Msk                  (_U_(0x1) << MCAN_TXBAR_AR9_Pos)               /**< (MCAN_TXBAR) Add Request for Transmit Buffer 9 Mask */
#define MCAN_TXBAR_AR9                      MCAN_TXBAR_AR9_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR9_Msk instead */
#define MCAN_TXBAR_AR10_Pos                 10                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 10 Position */
#define MCAN_TXBAR_AR10_Msk                 (_U_(0x1) << MCAN_TXBAR_AR10_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 10 Mask */
#define MCAN_TXBAR_AR10                     MCAN_TXBAR_AR10_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR10_Msk instead */
#define MCAN_TXBAR_AR11_Pos                 11                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 11 Position */
#define MCAN_TXBAR_AR11_Msk                 (_U_(0x1) << MCAN_TXBAR_AR11_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 11 Mask */
#define MCAN_TXBAR_AR11                     MCAN_TXBAR_AR11_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR11_Msk instead */
#define MCAN_TXBAR_AR12_Pos                 12                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 12 Position */
#define MCAN_TXBAR_AR12_Msk                 (_U_(0x1) << MCAN_TXBAR_AR12_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 12 Mask */
#define MCAN_TXBAR_AR12                     MCAN_TXBAR_AR12_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR12_Msk instead */
#define MCAN_TXBAR_AR13_Pos                 13                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 13 Position */
#define MCAN_TXBAR_AR13_Msk                 (_U_(0x1) << MCAN_TXBAR_AR13_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 13 Mask */
#define MCAN_TXBAR_AR13                     MCAN_TXBAR_AR13_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR13_Msk instead */
#define MCAN_TXBAR_AR14_Pos                 14                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 14 Position */
#define MCAN_TXBAR_AR14_Msk                 (_U_(0x1) << MCAN_TXBAR_AR14_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 14 Mask */
#define MCAN_TXBAR_AR14                     MCAN_TXBAR_AR14_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR14_Msk instead */
#define MCAN_TXBAR_AR15_Pos                 15                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 15 Position */
#define MCAN_TXBAR_AR15_Msk                 (_U_(0x1) << MCAN_TXBAR_AR15_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 15 Mask */
#define MCAN_TXBAR_AR15                     MCAN_TXBAR_AR15_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR15_Msk instead */
#define MCAN_TXBAR_AR16_Pos                 16                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 16 Position */
#define MCAN_TXBAR_AR16_Msk                 (_U_(0x1) << MCAN_TXBAR_AR16_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 16 Mask */
#define MCAN_TXBAR_AR16                     MCAN_TXBAR_AR16_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR16_Msk instead */
#define MCAN_TXBAR_AR17_Pos                 17                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 17 Position */
#define MCAN_TXBAR_AR17_Msk                 (_U_(0x1) << MCAN_TXBAR_AR17_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 17 Mask */
#define MCAN_TXBAR_AR17                     MCAN_TXBAR_AR17_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR17_Msk instead */
#define MCAN_TXBAR_AR18_Pos                 18                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 18 Position */
#define MCAN_TXBAR_AR18_Msk                 (_U_(0x1) << MCAN_TXBAR_AR18_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 18 Mask */
#define MCAN_TXBAR_AR18                     MCAN_TXBAR_AR18_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR18_Msk instead */
#define MCAN_TXBAR_AR19_Pos                 19                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 19 Position */
#define MCAN_TXBAR_AR19_Msk                 (_U_(0x1) << MCAN_TXBAR_AR19_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 19 Mask */
#define MCAN_TXBAR_AR19                     MCAN_TXBAR_AR19_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR19_Msk instead */
#define MCAN_TXBAR_AR20_Pos                 20                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 20 Position */
#define MCAN_TXBAR_AR20_Msk                 (_U_(0x1) << MCAN_TXBAR_AR20_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 20 Mask */
#define MCAN_TXBAR_AR20                     MCAN_TXBAR_AR20_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR20_Msk instead */
#define MCAN_TXBAR_AR21_Pos                 21                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 21 Position */
#define MCAN_TXBAR_AR21_Msk                 (_U_(0x1) << MCAN_TXBAR_AR21_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 21 Mask */
#define MCAN_TXBAR_AR21                     MCAN_TXBAR_AR21_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR21_Msk instead */
#define MCAN_TXBAR_AR22_Pos                 22                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 22 Position */
#define MCAN_TXBAR_AR22_Msk                 (_U_(0x1) << MCAN_TXBAR_AR22_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 22 Mask */
#define MCAN_TXBAR_AR22                     MCAN_TXBAR_AR22_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR22_Msk instead */
#define MCAN_TXBAR_AR23_Pos                 23                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 23 Position */
#define MCAN_TXBAR_AR23_Msk                 (_U_(0x1) << MCAN_TXBAR_AR23_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 23 Mask */
#define MCAN_TXBAR_AR23                     MCAN_TXBAR_AR23_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR23_Msk instead */
#define MCAN_TXBAR_AR24_Pos                 24                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 24 Position */
#define MCAN_TXBAR_AR24_Msk                 (_U_(0x1) << MCAN_TXBAR_AR24_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 24 Mask */
#define MCAN_TXBAR_AR24                     MCAN_TXBAR_AR24_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR24_Msk instead */
#define MCAN_TXBAR_AR25_Pos                 25                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 25 Position */
#define MCAN_TXBAR_AR25_Msk                 (_U_(0x1) << MCAN_TXBAR_AR25_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 25 Mask */
#define MCAN_TXBAR_AR25                     MCAN_TXBAR_AR25_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR25_Msk instead */
#define MCAN_TXBAR_AR26_Pos                 26                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 26 Position */
#define MCAN_TXBAR_AR26_Msk                 (_U_(0x1) << MCAN_TXBAR_AR26_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 26 Mask */
#define MCAN_TXBAR_AR26                     MCAN_TXBAR_AR26_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR26_Msk instead */
#define MCAN_TXBAR_AR27_Pos                 27                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 27 Position */
#define MCAN_TXBAR_AR27_Msk                 (_U_(0x1) << MCAN_TXBAR_AR27_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 27 Mask */
#define MCAN_TXBAR_AR27                     MCAN_TXBAR_AR27_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR27_Msk instead */
#define MCAN_TXBAR_AR28_Pos                 28                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 28 Position */
#define MCAN_TXBAR_AR28_Msk                 (_U_(0x1) << MCAN_TXBAR_AR28_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 28 Mask */
#define MCAN_TXBAR_AR28                     MCAN_TXBAR_AR28_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR28_Msk instead */
#define MCAN_TXBAR_AR29_Pos                 29                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 29 Position */
#define MCAN_TXBAR_AR29_Msk                 (_U_(0x1) << MCAN_TXBAR_AR29_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 29 Mask */
#define MCAN_TXBAR_AR29                     MCAN_TXBAR_AR29_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR29_Msk instead */
#define MCAN_TXBAR_AR30_Pos                 30                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 30 Position */
#define MCAN_TXBAR_AR30_Msk                 (_U_(0x1) << MCAN_TXBAR_AR30_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 30 Mask */
#define MCAN_TXBAR_AR30                     MCAN_TXBAR_AR30_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR30_Msk instead */
#define MCAN_TXBAR_AR31_Pos                 31                                             /**< (MCAN_TXBAR) Add Request for Transmit Buffer 31 Position */
#define MCAN_TXBAR_AR31_Msk                 (_U_(0x1) << MCAN_TXBAR_AR31_Pos)              /**< (MCAN_TXBAR) Add Request for Transmit Buffer 31 Mask */
#define MCAN_TXBAR_AR31                     MCAN_TXBAR_AR31_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBAR_AR31_Msk instead */
#define MCAN_TXBAR_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (MCAN_TXBAR) Register MASK  (Use MCAN_TXBAR_Msk instead)  */
#define MCAN_TXBAR_Msk                      _U_(0xFFFFFFFF)                                /**< (MCAN_TXBAR) Register Mask  */

#define MCAN_TXBAR_AR_Pos                   0                                              /**< (MCAN_TXBAR Position) Add Request for Transmit Buffer 3x */
#define MCAN_TXBAR_AR_Msk                   (_U_(0xFFFFFFFF) << MCAN_TXBAR_AR_Pos)         /**< (MCAN_TXBAR Mask) AR */
#define MCAN_TXBAR_AR(value)                (MCAN_TXBAR_AR_Msk & ((value) << MCAN_TXBAR_AR_Pos))  

