zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TXEFA_OFFSET                   (0xF8)                                        /**<  (MCAN_TXEFA) Transmit Event FIFO Acknowledge Register  Offset */

#define MCAN_TXEFA_EFAI_Pos                 0                                              /**< (MCAN_TXEFA) Event FIFO Acknowledge Index Position */
#define MCAN_TXEFA_EFAI_Msk                 (_U_(0x1F) << MCAN_TXEFA_EFAI_Pos)             /**< (MCAN_TXEFA) Event FIFO Acknowledge Index Mask */
#define MCAN_TXEFA_EFAI(value)              (MCAN_TXEFA_EFAI_Msk & ((value) << MCAN_TXEFA_EFAI_Pos))
#define MCAN_TXEFA_MASK                     _U_(0x1F)                                      /**< \deprecated (MCAN_TXEFA) Register MASK  (Use MCAN_TXEFA_Msk instead)  */
#define MCAN_TXEFA_Msk                      _U_(0x1F)                                      /**< (MCAN_TXEFA) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief MCAN hardware registers */
typedef struct {  
  __I  uint32_t MCAN_CREL;      /**< (MCAN Offset: 0x00) Core Release Register */
  __I  uint32_t MCAN_ENDN;      /**< (MCAN Offset: 0x04) Endian Register */
  __IO uint32_t MCAN_CUST;      /**< (MCAN Offset: 0x08) Customer Register */
  __IO uint32_t MCAN_DBTP;      /**< (MCAN Offset: 0x0C) Data Bit Timing and Prescaler Register */
  __IO uint32_t MCAN_TEST;      /**< (MCAN Offset: 0x10) Test Register */
  __IO uint32_t MCAN_RWD;       /**< (MCAN Offset: 0x14) RAM Watchdog Register */
  __IO uint32_t MCAN_CCCR;      /**< (MCAN Offset: 0x18) CC Control Register */
  __IO uint32_t MCAN_NBTP;      /**< (MCAN Offset: 0x1C) Nominal Bit Timing and Prescaler Register */
  __IO uint32_t MCAN_TSCC;      /**< (MCAN Offset: 0x20) Timestamp Counter Configuration Register */
  __IO uint32_t MCAN_TSCV;      /**< (MCAN Offset: 0x24) Timestamp Counter Value Register */
  __IO uint32_t MCAN_TOCC;      /**< (MCAN Offset: 0x28) Timeout Counter Configuration Register */
  __IO uint32_t MCAN_TOCV;      /**< (MCAN Offset: 0x2C) Timeout Counter Value Register */
  RoReg8  Reserved1[0x10];
  __I  uint32_t MCAN_ECR;       /**< (MCAN Offset: 0x40) Error Counter Register */
  __I  uint32_t MCAN_PSR;       /**< (MCAN Offset: 0x44) Protocol Status Register */
  __IO uint32_t MCAN_TDCR;      /**< (MCAN Offset: 0x48) Transmit Delay Compensation Register */
  RoReg8  Reserved2[0x4];
  __IO uint32_t MCAN_IR;        /**< (MCAN Offset: 0x50) Interrupt Register */
  __IO uint32_t MCAN_IE;        /**< (MCAN Offset: 0x54) Interrupt Enable Register */
  __IO uint32_t MCAN_ILS;       /**< (MCAN Offset: 0x58) Interrupt Line Select Register */
  __IO uint32_t MCAN_ILE;       /**< (MCAN Offset: 0x5C) Interrupt Line Enable Register */
  RoReg8  Reserved3[0x20];
  __IO uint32_t MCAN_GFC;       /**< (MCAN Offset: 0x80) Global Filter Configuration Register */
  __IO uint32_t MCAN_SIDFC;     /**< (MCAN Offset: 0x84) Standard ID Filter Configuration Register */
  __IO uint32_t MCAN_XIDFC;     /**< (MCAN Offset: 0x88) Extended ID Filter Configuration Register */
  RoReg8  Reserved4[0x4];
  __IO uint32_t MCAN_XIDAM;     /**< (MCAN Offset: 0x90) Extended ID AND Mask Register */
  __I  uint32_t MCAN_HPMS;      /**< (MCAN Offset: 0x94) High Priority Message Status Register */
  __IO uint32_t MCAN_NDAT1;     /**< (MCAN Offset: 0x98) New Data 1 Register */
  __IO uint32_t MCAN_NDAT2;     /**< (MCAN Offset: 0x9C) New Data 2 Register */
  __IO uint32_t MCAN_RXF0C;     /**< (MCAN Offset: 0xA0) Receive FIFO 0 Configuration Register */
  __I  uint32_t MCAN_RXF0S;     /**< (MCAN Offset: 0xA4) Receive FIFO 0 Status Register */
  __IO uint32_t MCAN_RXF0A;     /**< (MCAN Offset: 0xA8) Receive FIFO 0 Acknowledge Register */
  __IO uint32_t MCAN_RXBC;      /**< (MCAN Offset: 0xAC) Receive Rx Buffer Configuration Register */
  __IO uint32_t MCAN_RXF1C;     /**< (MCAN Offset: 0xB0) Receive FIFO 1 Configuration Register */
  __I  uint32_t MCAN_RXF1S;     /**< (MCAN Offset: 0xB4) Receive FIFO 1 Status Register */
  __IO uint32_t MCAN_RXF1A;     /**< (MCAN Offset: 0xB8) Receive FIFO 1 Acknowledge Register */
  __IO uint32_t MCAN_RXESC;     /**< (MCAN Offset: 0xBC) Receive Buffer / FIFO Element Size Configuration Register */
  __IO uint32_t MCAN_TXBC;      /**< (MCAN Offset: 0xC0) Transmit Buffer Configuration Register */
  __I  uint32_t MCAN_TXFQS;     /**< (MCAN Offset: 0xC4) Transmit FIFO/Queue Status Register */
  __IO uint32_t MCAN_TXESC;     /**< (MCAN Offset: 0xC8) Transmit Buffer Element Size Configuration Register */
  __I  uint32_t MCAN_TXBRP;     /**< (MCAN Offset: 0xCC) Transmit Buffer Request Pending Register */
  __IO uint32_t MCAN_TXBAR;     /**< (MCAN Offset: 0xD0) Transmit Buffer Add Request Register */
  __IO uint32_t MCAN_TXBCR;     /**< (MCAN Offset: 0xD4) Transmit Buffer Cancellation Request Register */
  __I  uint32_t MCAN_TXBTO;     /**< (MCAN Offset: 0xD8) Transmit Buffer Transmission Occurred Register */
  __I  uint32_t MCAN_TXBCF;     /**< (MCAN Offset: 0xDC) Transmit Buffer Cancellation Finished Register */
  __IO uint32_t MCAN_TXBTIE;    /**< (MCAN Offset: 0xE0) Transmit Buffer Transmission Interrupt Enable Register */
  __IO uint32_t MCAN_TXBCIE;    /**< (MCAN Offset: 0xE4) Transmit Buffer Cancellation Finished Interrupt Enable Register */
  RoReg8  Reserved5[0x8];
  __IO uint32_t MCAN_TXEFC;     /**< (MCAN Offset: 0xF0) Transmit Event FIFO Configuration Register */
  __I  uint32_t MCAN_TXEFS;     /**< (MCAN Offset: 0xF4) Transmit Event FIFO Status Register */
  __IO uint32_t MCAN_TXEFA;     /**< (MCAN Offset: 0xF8) Transmit Event FIFO Acknowledge Register */
} Mcan;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief MCAN hardware registers */
typedef struct {  
  __I  MCAN_CREL_Type                 MCAN_CREL;      /**< Offset: 0x00 (R/   32) Core Release Register */
  __I  MCAN_ENDN_Type                 MCAN_ENDN;      /**< Offset: 0x04 (R/   32) Endian Register */
  __IO MCAN_CUST_Type                 MCAN_CUST;      /**< Offset: 0x08 (R/W  32) Customer Register */
  __IO MCAN_DBTP_Type                 MCAN_DBTP;      /**< Offset: 0x0C (R/W  32) Data Bit Timing and Prescaler Register */
  __IO MCAN_TEST_Type                 MCAN_TEST;      /**< Offset: 0x10 (R/W  32) Test Register */
  __IO MCAN_RWD_Type                  MCAN_RWD;       /**< Offset: 0x14 (R/W  32) RAM Watchdog Register */
  __IO MCAN_CCCR_Type                 MCAN_CCCR;      /**< Offset: 0x18 (R/W  32) CC Control Register */
  __IO MCAN_NBTP_Type                 MCAN_NBTP;      /**< Offset: 0x1C (R/W  32) Nominal Bit Timing and Prescaler Register */
  __IO MCAN_TSCC_Type                 MCAN_TSCC;      /**< Offset: 0x20 (R/W  32) Timestamp Counter Configuration Register */
  __IO MCAN_TSCV_Type                 MCAN_TSCV;      /**< Offset: 0x24 (R/W  32) Timestamp Counter Value Register */
  __IO MCAN_TOCC_Type                 MCAN_TOCC;      /**< Offset: 0x28 (R/W  32) Timeout Counter Configuration Register */
  __IO MCAN_TOCV_Type                 MCAN_TOCV;      /**< Offset: 0x2C (R/W  32) Timeout Counter Value Register */
  __I  uint32_t                       Reserved1[4];
  __I  MCAN_ECR_Type                  MCAN_ECR;       /**< Offset: 0x40 (R/   32) Error Counter Register */
  __I  MCAN_PSR_Type                  MCAN_PSR;       /**< Offset: 0x44 (R/   32) Protocol Status Register */
  __IO MCAN_TDCR_Type                 MCAN_TDCR;      /**< Offset: 0x48 (R/W  32) Transmit Delay Compensation Register */
  __I  uint32_t                       Reserved2[1];
  __IO MCAN_IR_Type                   MCAN_IR;        /**< Offset: 0x50 (R/W  32) Interrupt Register */
  __IO MCAN_IE_Type                   MCAN_IE;        /**< Offset: 0x54 (R/W  32) Interrupt Enable Register */
  __IO MCAN_ILS_Type                  MCAN_ILS;       /**< Offset: 0x58 (R/W  32) Interrupt Line Select Register */
  __IO MCAN_ILE_Type                  MCAN_ILE;       /**< Offset: 0x5C (R/W  32) Interrupt Line Enable Register */
  __I  uint32_t                       Reserved3[8];
  __IO MCAN_GFC_Type                  MCAN_GFC;       /**< Offset: 0x80 (R/W  32) Global Filter Configuration Register */
  __IO MCAN_SIDFC_Type                MCAN_SIDFC;     /**< Offset: 0x84 (R/W  32) Standard ID Filter Configuration Register */
  __IO MCAN_XIDFC_Type                MCAN_XIDFC;     /**< Offset: 0x88 (R/W  32) Extended ID Filter Configuration Register */
  __I  uint32_t                       Reserved4[1];
  __IO MCAN_XIDAM_Type                MCAN_XIDAM;     /**< Offset: 0x90 (R/W  32) Extended ID AND Mask Register */
  __I  MCAN_HPMS_Type                 MCAN_HPMS;      /**< Offset: 0x94 (R/   32) High Priority Message Status Register */
  __IO MCAN_NDAT1_Type                MCAN_NDAT1;     /**< Offset: 0x98 (R/W  32) New Data 1 Register */
  __IO MCAN_NDAT2_Type                MCAN_NDAT2;     /**< Offset: 0x9C (R/W  32) New Data 2 Register */
  __IO MCAN_RXF0C_Type                MCAN_RXF0C;     /**< Offset: 0xA0 (R/W  32) Receive FIFO 0 Configuration Register */
  __I  MCAN_RXF0S_Type                MCAN_RXF0S;     /**< Offset: 0xA4 (R/   32) Receive FIFO 0 Status Register */
  __IO MCAN_RXF0A_Type                MCAN_RXF0A;     /**< Offset: 0xA8 (R/W  32) Receive FIFO 0 Acknowledge Register */
  __IO MCAN_RXBC_Type                 MCAN_RXBC;      /**< Offset: 0xAC (R/W  32) Receive Rx Buffer Configuration Register */
  __IO MCAN_RXF1C_Type                MCAN_RXF1C;     /**< Offset: 0xB0 (R/W  32) Receive FIFO 1 Configuration Register */
  __I  MCAN_RXF1S_Type                MCAN_RXF1S;     /**< Offset: 0xB4 (R/   32) Receive FIFO 1 Status Register */
  __IO MCAN_RXF1A_Type                MCAN_RXF1A;     /**< Offset: 0xB8 (R/W  32) Receive FIFO 1 Acknowledge Register */
  __IO MCAN_RXESC_Type                MCAN_RXESC;     /**< Offset: 0xBC (R/W  32) Receive Buffer / FIFO Element Size Configuration Register */
  __IO MCAN_TXBC_Type                 MCAN_TXBC;      /**< Offset: 0xC0 (R/W  32) Transmit Buffer Configuration Register */
  __I  MCAN_TXFQS_Type                MCAN_TXFQS;     /**< Offset: 0xC4 (R/   32) Transmit FIFO/Queue Status Register */
  __IO MCAN_TXESC_Type                MCAN_TXESC;     /**< Offset: 0xC8 (R/W  32) Transmit Buffer Element Size Configuration Register */
  __I  MCAN_TXBRP_Type                MCAN_TXBRP;     /**< Offset: 0xCC (R/   32) Transmit Buffer Request Pending Register */
  __IO MCAN_TXBAR_Type                MCAN_TXBAR;     /**< Offset: 0xD0 (R/W  32) Transmit Buffer Add Request Register */
  __IO MCAN_TXBCR_Type                MCAN_TXBCR;     /**< Offset: 0xD4 (R/W  32) Transmit Buffer Cancellation Request Register */
  __I  MCAN_TXBTO_Type                MCAN_TXBTO;     /**< Offset: 0xD8 (R/   32) Transmit Buffer Transmission Occurred Register */
  __I  MCAN_TXBCF_Type                MCAN_TXBCF;     /**< Offset: 0xDC (R/   32) Transmit Buffer Cancellation Finished Register */
  __IO MCAN_TXBTIE_Type               MCAN_TXBTIE;    /**< Offset: 0xE0 (R/W  32) Transmit Buffer Transmission Interrupt Enable Register */
  __IO MCAN_TXBCIE_Type               MCAN_TXBCIE;    /**< Offset: 0xE4 (R/W  32) Transmit Buffer Cancellation Finished Interrupt Enable Register */
  __I  uint32_t                       Reserved5[2];
  __IO MCAN_TXEFC_Type                MCAN_TXEFC;     /**< Offset: 0xF0 (R/W  32) Transmit Event FIFO Configuration Register */
  __I  MCAN_TXEFS_Type                MCAN_TXEFS;     /**< Offset: 0xF4 (R/   32) Transmit Event FIFO Status Register */
  __IO MCAN_TXEFA_Type                MCAN_TXEFA;     /**< Offset: 0xF8 (R/W  32) Transmit Event FIFO Acknowledge Register */
} Mcan;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Controller Area Network */

#endif /* _SAME70_MCAN_COMPONENT_H_ */
